# TableCellStyleOverrideOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions Class
Members See Also
---
This helper class represents the overridden characteristics of the associated cell.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class TableCellStyleOverrideOptions : IDisposable
```

Visual Basic
---
```text
Public Class TableCellStyleOverrideOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class TableCellStyleOverrideOptions : IDisposable
```

# Remarks
The user can override the text appearance and cell graphic properties by setting the corresponding flag to true. The global base format will control the non-overridden characteristics.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..TableCellStyleOverrideOptions
# See Also
TableCellStyleOverrideOptions Members
Autodesk.Revit.DB Namespace